## Plan Result (sbox-05-mis)




<pre><code>Plan: 16 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.sops-policy
  * azurerm_key_vault_key.sops-key
  * azurerm_resource_group.application-mi
  * azurerm_role_assignment.Reader
  * azurerm_role_assignment.acme-vault-access
  * azurerm_role_assignment.genesis_managed_identity_operator
  * azurerm_role_assignment.global_registry_acrpull
  * azurerm_role_assignment.kubelet_uami_genesis
  * azurerm_role_assignment.log_analytics_role_MI
  * azurerm_role_assignment.log_analytics_role_aks_sp
  * azurerm_role_assignment.network_access
  * azurerm_role_assignment.project_registry_acrpull
  * azurerm_role_assignment.sbox_registry_acrpull[&#34;sbox&#34;]
  * azurerm_role_assignment.uami_rg_identity_operator
  * azurerm_user_assigned_identity.kubelet_uami
  * azurerm_user_assigned_identity.sops-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.sops-policy will be created
  + resource "azurerm_key_vault_access_policy" "sops-policy" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "Encrypt",
          + "Decrypt",
          + "List",
        ]
      + key_vault_id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dtssharedservicessboxkv"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_key.sops-key will be created
  + resource "azurerm_key_vault_key" "sops-key" {
      + curve              = (known after apply)
      + e                  = (known after apply)
      + id                 = (known after apply)
      + key_opts           = [
          + "decrypt",
          + "encrypt",
        ]
      + key_size           = 2048
      + key_type           = "RSA"
      + key_vault_id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dtssharedservicessboxkv"
      + n                  = (known after apply)
      + name               = "sops-key"
      + public_key_openssh = (known after apply)
      + public_key_pem     = (known after apply)
      + version            = (known after apply)
      + versionless_id     = (known after apply)
      + x                  = (known after apply)
      + y                  = (known after apply)
    }

  # azurerm_resource_group.application-mi will be created
  + resource "azurerm_resource_group" "application-mi" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "managed-identities-sbox-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
    }

  # azurerm_role_assignment.Reader will be created
  + resource "azurerm_role_assignment" "Reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dtssharedservicessboxkv"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.acme-vault-access will be created
  + resource "azurerm_role_assignment" "acme-vault-access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.genesis_managed_identity_operator will be created
  + resource "azurerm_role_assignment" "genesis_managed_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.global_registry_acrpull will be created
  + resource "azurerm_role_assignment" "global_registry_acrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.kubelet_uami_genesis will be created
  + resource "azurerm_role_assignment" "kubelet_uami_genesis" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.log_analytics_role_MI will be created
  + resource "azurerm_role_assignment" "log_analytics_role_MI" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.log_analytics_role_aks_sp will be created
  + resource "azurerm_role_assignment" "log_analytics_role_aks_sp" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.network_access will be created
  + resource "azurerm_role_assignment" "network_access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.project_registry_acrpull will be created
  + resource "azurerm_role_assignment" "project_registry_acrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-acr-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.sbox_registry_acrpull["sbox"] will be created
  + resource "azurerm_role_assignment" "sbox_registry_acrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-acr-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.uami_rg_identity_operator will be created
  + resource "azurerm_role_assignment" "uami_rg_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.kubelet_uami will be created
  + resource "azurerm_user_assigned_identity" "kubelet_uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "aks-kubelet-sbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "genesis-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + tenant_id           = (known after apply)
    }

  # azurerm_user_assigned_identity.sops-mi will be created
  + resource "azurerm_user_assigned_identity" "sops-mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "aks-sbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "genesis-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + tenant_id           = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":232,"Program":"tfcmt","SHA1":"","Target":"sbox-05-mis","Vars":{}} -->